/*Таблицы: Н_ЛЮДИ, Н_ВЕДОМОСТИ, Н_СЕССИЯ.
Вывести атрибуты: Н_ЛЮДИ.ОТЧЕСТВО, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ДАТА.
Фильтры (AND):
a) Н_ЛЮДИ.ОТЧЕСТВО = Георгиевич.
b) Н_ВЕДОМОСТИ.ЧЛВК_ИД = 105590.
Вид соединения: RIGHT JOIN*/

explain analyze select "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", "Н_СЕССИЯ"."ДАТА"
from "Н_ЛЮДИ"
         right join "Н_ВЕДОМОСТИ" on ("Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
         right join "Н_СЕССИЯ" on ("Н_СЕССИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
where "Н_ЛЮДИ"."ОТЧЕСТВО" = 'Георгиевич'
  and "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = 105590;

/*create index "НВ_ЧЛВК_ИД" on "Н_ВЕДОМОСТИ" using hash("ЧЛВК_ИД");*/