select "Н_УЧЕНИКИ"."ЧЛВК_ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", avg("СОРТ")
from "Н_УЧЕНИКИ"
         join "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
         join "Н_ОЦЕНКИ" on "Н_ОЦЕНКИ"."КОД" = "ОЦЕНКА"
         join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
where "ГРУППА" = '4100'
group by "Н_УЧЕНИКИ"."ЧЛВК_ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО"
having avg("СОРТ") < (
    select max(avg_sort)
    from (
             select avg("СОРТ") as avg_sort
             from "Н_УЧЕНИКИ"
                      join "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
                      join "Н_ОЦЕНКИ" on "Н_ОЦЕНКИ"."КОД" = "ОЦЕНКА"
             where "ГРУППА" = '1100'
             group by "Н_УЧЕНИКИ"."ЧЛВК_ИД") as averageMark);
